//CADCLI JOB CLASS=C,MSGCLASS=H,MSGLEVEL=(1,1),REGION=4096K
//JOBPROC DD DISP=SHR,DSN=HERC01.KICKSSYS.V1R5M0.PROCLIB,
//           SYSPROC=YES
//*
//P7MAIN   EXEC K2KCOBCL
//COPY.SYSUT1 DD DISP=SHR,DSN=HERC01.KICKS.V1R5M0.COB(CADCLI)
//LKED.SYSLMOD DD DISP=SHR,
//         DSN=HERC01.KICKS.V1R5M0.KIKRPL(CADCLI)
//LKED.SYSIN DD *
  INCLUDE SKIKLOAD(KIKCOBGL)
  ENTRY CADCLI
  NAME CADCLI(R)
/*
