//MAPSCA JOB CLASS=C,MSGCLASS=H,MSGLEVEL=(1,1),REGION=4096K
//JOBPROC DD DISP=SHR,DSN=HERC01.KICKSSYS.V1R5M0.PROCLIB
//*
//MAPA EXEC KIKMAPS,MAPNAME=MAPSCA
//COPY.SYSUT1 DD DISP=SHR,DSN=HERC01.KICKS.V1R5M0.MAPSRC(MAPSCA)
